########################
# Base Macros
# Make changes here for sourcetypes or default index
########################

[pan_index]
definition = index=pan_logs

[pan_threat]
definition = `pan_index` sourcetype="pan_threat" (log_subtype!="file" AND log_subtype!="url" AND log_subtype!="data" AND log_subtype!="wildfire")

[pan_threat_all]
definition = `pan_index` sourcetype="pan_threat"

[pan_traffic]
definition = `pan_index` sourcetype="pan_traffic"

[pan_system]
definition = `pan_index` sourcetype="pan_system"

[pan_config]
definition = `pan_index` sourcetype="pan_config"

[pan_web_activity]
definition = `pan_index` log_subtype="url" sourcetype="pan_threat"

[pan_url]
definition = `pan_index` log_subtype="url" sourcetype="pan_threat"

[pan_data_filtering]
definition = `pan_index` log_subtype="data" sourcetype="pan_threat"

[pan_data]
definition = `pan_index` log_subtype="data" sourcetype="pan_threat"

[pan_file_blocking]
definition = `pan_index` log_subtype="file" sourcetype="pan_threat"

[pan_file]
definition = `pan_index` log_subtype="file" sourcetype="pan_threat"

[pan_wildfire]
definition = `pan_index` log_subtype="wildfire" sourcetype="pan_threat"

[pan_wildfire_report]
definition = `pan_index` sourcetype="pan_wildfire_report"

[pan_endpoint]
definition = `pan_index` sourcetype="pan_endpoint"

[pan_newapps]
definition = `pan_index` sourcetype="pan_newapps"

########################
# macros used internally by dashboards
########################

[_pan_dropdown(2)]
args = node, field
definition = tstats summariesonly=t count FROM datamodel="pan_logs" WHERE nodename="$node$" groupby $field$ | rename $field$ as field | eval field_with_count = field . " (" . count . ")"

[top]
definition = sort -count | head 999

[top(1)]
args = num
definition = sort -count | head $num$

[groupby(1)]
args = fields
definition = "GROUPBY " + "$fields$" + " | rename " + replace(replace("$fields$", "^.*?log\.(.*)", "log.\1"), "log.([^ ]*)", "log.\1 AS \1")
iseval = true

[table(1)]
args = fields
definition = "GROUPBY " + "$fields$" + " | rename " + replace(replace("$fields$", "^.*?log\.(.*)", "log.\1"), "log.([^ ]*)", "log.\1 AS \1") + " | table " + replace("$fields$", "log.([^ ]*)", "\1")
iseval = true

[table(2)]
args = fields, count
definition = `table($fields$)` $count$ | `top`

########################
# base macro for tstats
########################

[tstats]
definition = tstats summariesonly=t
# definition = tstats prestats=true local=`tstats_local`

[node(1)]
args = nodename
definition = datamodel="pan_logs" WHERE nodename="$nodename$"

[tstats_local]
definition = false

########################
# NFI macros
########################

[formatbytes(1)]
args = bytes
definition = case($bytes$ > 1073741824, tostring(round($bytes$/1073741824,2))+" GB", $bytes$ > 1048576, tostring(round($bytes$/1048576,2))+" MB", $bytes$ > 1024, tostring(round($bytes$/1024))+" KB", $bytes$ <= 1024, tostring($bytes$)+" Bytes")

[formatbytestom(1)]
args = bytes
definition = $bytes$/1048576

[formatbps(1)]
args = bps
definition = case($bps$ > 1000000000, tostring(round($bps$/1000000000,2))+" Gbps", $bps$ > 1000000, tostring(round($bps$/1000000,2))+" Mbps", $bps$ > 1000, tostring(round($bps$/1000,2))+" Kbps", $bps$ <= 1000, tostring(ceil($bps$))+" bps")

[formatpps(1)]
args=pps
definition = tostring(round($pps$,2))+" pps"

[nfi_common_search]
definition = index=flowintegrator sourcetype=flowintegrator

[nfi_pan_unified]
definition = `nfi_common_search` nfc_id=20030 OR nfc_id=20031 OR nfc_id=20032 OR nfc_id=20033 OR nfc_id=20034 OR nfc_id=20035

[nfi_pan_20030]
definition = `nfi_common_search` nfc_id=20030

[nfi_pan_20031]
definition = `nfi_common_search` nfc_id=20031

[nfi_pan_20032]
definition = `nfi_common_search` nfc_id=20032

[nfi_pan_20033]
definition = `nfi_common_search` nfc_id=20033

[nfi_pan_20034]
definition = `nfi_common_search` nfc_id=20034

[nfi_pan_20035]
definition = `nfi_common_search` nfc_id=20035

[nfi_all_fields_20030]
definition = exp_ip src_ip user created_count denied_count bytes percent_of_total _time

[nfi_all_fields_20031]
definition = exp_ip dest_ip dest_port created_count denied_count bytes percent_of_total _time

[nfi_all_fields_20032]
definition = exp_ip src_ip dest_port user denied_count _time

[nfi_all_fields_20033]
definition = exp_ip src_ip dest_port user created_count _time

[nfi_all_fields_20034]
definition = exp_ip app created_count bytes percent_of_total _time

[nfi_all_fields_20035]
definition = exp_ip app user created_count bytes percent_of_total _time

