########################
# Tsidx stats collections 
########################

[PAN - Traffic - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_traffic` | table _time log_subtype vsys app action bytes bytes_sent bytes_received dst_ip egress_interface ingress_interface dst_port dst_user packets protocol src_ip src_user | tscollect namespace=pan_traffic
disabled = 0

[PAN - Web Activity - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_web_activity` | table _time vsys app category dst_ip src_ip dst_hostname src_user action | tscollect namespace=pan_web
disabled = 0

[PAN - Threat - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_threat` | table _time vsys app dst_user threat_id severity category src_ip dst_ip log_subtype RISK | tscollect namespace=pan_threat
disabled = 0

[PAN - ThreatDetail - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_index` NOT "THREAT,url" | eval User=coalesce(src_user,dst_user,"unknown_user") | eval External_IP=if(isnull(direction), dst_ip, src_ip) | eval Location=if(isnull(direction), dst_location, src_location) |rename application AS Application |rename session_id AS Session |stats values(sourcetype) as SourceType values(threat_id) as Threat sum(bytes) as Bytes sum(elapsed_time) as Duration by Session User External_IP Application Location | search (SourceType="pan_threat" OR SourceType="pan_threat-2050") Bytes !="" Location != "" User !="" | table Session User External_IP Application Location SourceType Threat Bytes Duration | tscollect namespace=pan_threatDetail
disabled = 0

[PAN - Content - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_web_activity` content_type=* | table _time vsys app category src_ip dst_ip dst_hostname src_user action content_type |rex field="content_type" "(?<Major_Type>.*)/" | tscollect namespace=pan_content
disabled = 0

[PAN - Data Filtering - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_data_filtering` | table _time src_user dst_location src_ip dst_ip app threat_id action vsys | tscollect namespace=pan_data
disabled = 0

[PAN - Data Filtering - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_data_filtering` | table _time src_user dst_location src_ip dst_ip app threat_id action vsys | tscollect namespace=pan_data
disabled = 0

[PAN - System - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_system` | table _time vsys log_subtype description severity event_id module serial_number | tscollect namespace=pan_system
disabled = 0

[PAN - Config - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `pan_config` | table _time vsys host admin client cmd configuration_path result serial_number log_subtype| tscollect namespace=pan_config
disabled = 0

[PAN - Traffic - Applications]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = rt-5m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = `pan_index` sourcetype=pan_traffic  | stats sparkline sum(bytes) AS sbytes by app vsys src_zone | sort -sbytes | head 5 | eval Application=upper(app) | eval "Volume in MB"=round(sbytes/1024/1024) |rename sparkline AS Distribution | rename vsys AS VSYS| rename src_zone AS "Source Zone" | table Application VSYS "Source Zone" "Volume in MB" Distribution
