
##
## More information on all searchbar commands
##
##   http://pansplunk.readthedocs.io/en/latest/commands.html
##


########################
# pantag
########################
[pantag-command]
syntax = pantag device=<hostname>|panorama=<hostname> serial=<serial-of-device-in-panorama> vsys=<vsys#> action=<add|remove> ip_field=<field-containing-IPs> tag=<tag>|tag_field=<field-containing-tags>
shortdesc = Add/Remove an IP from a Dynamic Address Group in a Palo Alto Networks Firewall
description = Tag or remove tags for IP addresses on a Palo Alto Networks Firewall. Tags are leveraged to populate Dynamic Address Groups in a security policy which adds context to the security enforcement capabilities. It may take up to a minute for the tagged IP to show up in the Dynamic Address Group. You must set the username and password for the device in the App configuration. Passwords are encrypted.
usage = public
example1 = `pan_threat` log_subtype="spyware" | stats dc(src_ip) by src_ip | pantag device="10.1.1.1" action="add" tag="infected-host"
comment1 = Any IP on the network that generated a spyware (command-and-control traffic) alert is tagged as an infected host on the firewall at 10.1.1.1.
example2 = sourcetype="linux_messages_syslog" | pantag panorama="10.4.4.4" serial="0005001028200" ip_field="host" tag="linux-host"
comment2 = Tag any IP that is generating linux syslogs as a linux host on the firewall. Tag is applied to the firewall with serial 0005001028200 via the Panorama at 10.4.4.4.
example3 = `pan_traffic` | pantag device="10.1.1.1" ip_field="src_ip" tag_field="src_class"
comment3 = Tag every IP address on the firewall with their Splunk classification (from the IP classification lookup table)
example4 = `pan_url` dest_hostname="www.splunk.com" | pantag device="main-fw.company.com" vsys="vsys3" action="remove" ip_field="dest_ip" tag="suspicious-ip-addresses"
comment4 = If anyone tries to connect to www.splunk.com, remove the tag 'suspicious-ip-address' from the IP of the website. Tag is removed on vsys3 of firewall with hostname main-fw.company.com.
related = panuserupdate
tags = pan

########################
# panuserupdate
########################
[panuserupdate-command]
syntax = panuserupdate device=<hostname>|panorama=<hostname> serial=<serial-of-device-in-panorama> vsys=<vsys#> action=<login|logout> ip_field=<field-containing-IPs> user_field=<field-containing-usernames>
shortdesc = Synchronize user logins and logouts with a Palo Alto Networks Firewall
description = The User-ID system in a Palo Alto Networks Firewall can track user logins so you can write a security policy based on users and groups instead of IP addresses. Splunk can tell the firewall when users login or logout based on authentication logs received by Splunk. Send user logins to the User-ID firewall which will propagate the users to all other firewalls.
usage = public
example1 = sourcetype=radius login | panuserupdate device="10.1.1.1" action="login" ip_field="src_ip" user_field="username"
comment1 = When a radius authentication log is received by Splunk, tell the firewall that the user logged.
example2 = sourcetype=radius logout | panuserupdate panorama="10.4.4.4" serial="0004001028200" action="logout"
comment2 = Notifies the firewall of a radius user logout via Panorama. The default fields src_ip and user are used to gather the IP and Username.
related = pantag
tags = pan

########################
# pancontentpack
########################
[pancontentpack-command]
syntax = pancontentpack <hostname-of-firewall-or-panorama> <apps|threats>
shortdesc = Gather metadata about the apps and threats from the content pack loaded on a Firewall or Panorama.
description = Gather metadata about the apps and threats from the content pack loaded on a Firewall or Panorama.  This command can be used to update the app and threat lookup tables.  See the documentation for this Splunk app for more information.
usage = public
example1 = | pancontentpack 10.5.5.5 apps
comment1 = Display a table of app information from the application content pack loaded on the device at 10.5.5.5.
example2 = | pancontentpack 10.7.7.7 threats
comment2 = Display a table of threat information from the content pack loaded on the device at 10.7.7.7.
related = pantag
tags = pan

