
##
## More information on all searchbar commands
##
##   http://pansplunk.readthedocs.org/en/latest/commands.html
##


########################
# pantag
########################
[pantag-command]
syntax = pantag device=<hostname>|panorama=<hostname> serial=<serial-of-device-in-panorama> vsys=<vsys#> action=<add|remove> ip_field=<field-containing-IPs> tag=<tag>|tag_field=<field-containing-tags>
shortdesc = Add/Remove an IP from a Dynamic Address Group in a Palo Alto Networks Firewall
description = Tag or remove tags for IP addresses on a Palo Alto Networks Firewall. Tags are leveraged to populate Dynamic Address Groups in a security policy which adds context to the security enforcement capabilities. It may take up to a minute for the tagged IP to show up in the Dynamic Address Group. You must set the username and password for the device in the App configuration. Passwords are encrypted.
usage = public
example1 = `pan_threat` log_subtype="spyware" | stats dc(src_ip) by src_ip | pantag device="10.1.1.1" action="add" tag="infected-host"
comment1 = Any IP on the network that generated a spyware (command-and-control traffic) alert is tagged as an infected host on the firewall at 10.1.1.1.
example2 = sourcetype="linux_messages_syslog" | pantag panorama="10.4.4.4" serial="0005001028200" ip_field="host" tag="linux-host"
comment2 = Tag any IP that is generating linux syslogs as a linux host on the firewall. Tag is applied to the firewall with serial 0005001028200 via the Panorama at 10.4.4.4.
example3 = `pan_traffic` | pantag device="10.1.1.1" ip_field="src_ip" tag_field="src_class"
comment3 = Tag every IP address on the firewall with their Splunk classification (from the IP classification lookup table)
example4 = `pan_url` dest_hostname="www.splunk.com" | pantag device="main-fw.company.com" vsys="vsys3" action="remove" ip_field="dest_ip" tag="suspicious-ip-addresses"
comment4 = If anyone tries to connect to www.splunk.com, remove the tag 'suspicious-ip-address' from the IP of the website. Tag is removed on vsys3 of firewall with hostname main-fw.company.com.
related = panuserupdate
tags = pan

########################
# panuserupdate
########################
[panuserupdate-command]
syntax = panuserupdate device=<hostname>|panorama=<hostname> serial=<serial-of-device-in-panorama> vsys=<vsys#> action=<login|logout> ip_field=<field-containing-IPs> user_field=<field-containing-usernames>
shortdesc = Synchronize user logins and logouts with a Palo Alto Networks Firewall
description = The User-ID system in a Palo Alto Networks Firewall can track user logins so you can write a security policy based on users and groups instead of IP addresses. Splunk can tell the firewall when users login or logout based on authentication logs received by Splunk. Send user logins to the User-ID firewall which will propagate the users to all other firewalls.
usage = public
example1 = sourcetype=radius login | panuserupdate device="10.1.1.1" action="login" ip_field="src_ip" user_field="username"
comment1 = When a radius authentication log is received by Splunk, tell the firewall that the user logged.
example2 = sourcetype=radius logout | panuserupdate panorama="10.4.4.4" serial="0004001028200" action="logout"
comment2 = Notifies the firewall of a radius user logout via Panorama. The default fields src_ip and user are used to gather the IP and Username.
related = pantag
tags = pan

########################
# pancontentpack
########################
[pancontentpack-command]
syntax = pancontentpack <hostname-of-firewall-or-panorama> <apps|threats>
shortdesc = Gather metadata about the apps and threats from the content pack loaded on a Firewall or Panorama.
description = Gather metadata about the apps and threats from the content pack loaded on a Firewall or Panorama.  This command can be used to update the app and threat lookup tables.  See the documentation for this Splunk app for more information.
usage = public
example1 = | pancontentpack 10.5.5.5 apps
comment1 = Display a table of app information from the application content pack loaded on the device at 10.5.5.5.
example2 = | pancontentpack 10.7.7.7 threats
comment2 = Display a table of threat information from the content pack loaded on the device at 10.7.7.7.
related = pantag
tags = pan


########################
# panblock (deprecated)
########################
[panblock-command]
syntax = panblock
shortdesc = Add/Remove host on the Palo Alto Firewall
description = Given a table containing an IP address or a fully qualified domain name (FQDN), adds or removes the IP or FQDN from a specified group.  Options are action: vsys, group, device. It may take up to a minute before the submitted action is committed to the PAN config. You have to set the username and password for the device in the panChange.py file in $SPLUNK_HOME/etc/apps/SplunkforPaloAltoNetworks/bin/ . The password is stored in clear text. 
usage = deprecated
example1 = index=pan_logs 1.1.1.1 | stats dc(dest_ip) by dest_ip | panblock action="add" group="badboys"
comment1 = Adds the IP 1.1.1.1 
example2 = index=pan_logs wine | stats dc(dest_hostname) by dest_hostname | panblock action="rem" group="badboys" device="sales-fw"
comment2 = Removes all dest_hostnames returned by the search from the sales firewall from the badboys group.
related = panupdate pantag
tags = pan

########################
# panupdate (deprecated)
########################
[panupdate-command]
syntax = panupdate device=<Panorama IP> devicegroup=<group to be updated>
shortdesc = Adds Dynamic Address objects and maps users to those objects
description = The command takes user-id and IP addresses and inputs the Panorama and individual firewall configurations with those IP addresses. The command expects two fields, addrip and addruser. Use the rename command if your userid and ip fields have different labels.  It may take up to a minute for the changes to take effect in the Panorama and PAN devices.  The credentials for Panorama must be set using the Splunk for PaloAlto Network app's setup page.  The devicegroup must exist in the Panorama prior to execution of the command Debugging and other output is here: $SPLUNK_HOME/var/log/splunk/python.log
usage = deprecated
example1 = index=main sourcetype=radius | panupdate device="192.168.4.211" devicegroup="homedev" 
comment1 = Search for all RADIUS logs and update the Panorama's homedev devicegroup with the user-id and IP's. 
example2 = index=main sourcetype=authlog | rename user AS addruser | rename src_ip AS addrip | panupdate device="192.168.4.211" devicegroup="hotel-lobby"
comment2 = Search for all authlogs. Reanme the user and src_ip fields as addruser and addrip, respectively. Update the 'hotel-lobby' device group with the user-id's and IP's
related = panblock pantag
tags = pan
